1.
# Задана матрица размером 3*4
M = [
    [ 5.2, 2.8, 1.1, 4.4 ],
    [ 0.8, 2.3, 8.4, 5.0 ],
    [ 1.1, 3.2, 5.5, 1.0 ],
    ]

# вычисление суммы элементов матрицы, 
# значение которых больше 5.0

2.
#Написать функцию season, принимающую 1 аргумент — 
#номер месяца (от 1 до 12), и возвращающую время года,
#которому этот 
#месяц принадлежит (зима, весна, лето или осень).

3.
# Создание таблицы с размером 3x3, заполненной двойками

4.
#Дан список со строками, содержащими целые числа:
    #['1', '2', '3', '4', '5']
#Преобразуйте элементы этого списка в числа:
    #[1, 2, 3, 4, 5]

5.
#С помощью цикла заполните список четными 
# числами из промежутка от 1 до 100.

6.
#Дана строка с буквами и цифрами. 
#Узнайте сколько цифр в строке.
.isdigit()

7.
#Дан список со строками. 
#Оставьте в этом списке только те строки, 
#которые начинаются на http://.

8.
# Напишите функцию amountList, 
# которая возвращает сумму всех элементов списка.

9.
# Напишите функцию fact, вычисляющую значение факториала числа N.
# Факториал числа - это произведение всех чисел от 1 до N.
# Например, факториал числа 5 равен 120 (5! = 120).


