Написать функцию is_year_leap,
принимающую 1 аргумент — год, 
и возвращающую True, 
если год високосный, и False иначе.

#Любой год, который делится на 4 без остатка, 
# является високосным годом: например, 
# 1988, 1992 и 1996 годы являются високосными годами.

Написать функцию square, принимающую 1 аргумент — 
сторону квадрата, и возвращающую 3 значения (с помощью кортежа):
периметр квадрата, площадь квадрата
    
    
    
Периметр - Р = а + а + а + а.
Плошадь - a * a


Написать функцию season, принимающую 1 аргумент — 
номер месяца (от 1 до 12), и возвращающую время года,
которому этот 
месяц принадлежит (зима, весна, лето или осень).

Написать функцию arithmetic, принимающую 3 аргумента: 
первые 2 - числа, третий - операция, 
которая должна быть произведена над ними. 
Если третий аргумент +, сложить их; если —, 
то вычесть; * — умножить; / — разделить (первое на второе). 
В остальных случаях вернуть строку "Неизвестная операция".
