#Задача №1. 
#Напишите программу, которая считывает одну строку. 
#Если это строка Python, программа выведет «Да», если нет, то «Нет»

a = int(input('1 - '))
b = int(input('2 - '))

if a + b == 10:
    print("Верно")
else:
    print("Неверно")

#Задача №2. 
#Напишите программу, которая считывает три числа 
#и подсчитывает количество четных чисел.

#Задача 3. А год-то високосный?

#На вход программе подается строка – номер года. 
#Необходимо вычислить является ли данный год високосным или нет. 
# Если год високосный – вывести в консоль «Год високосный», 
# если нет «Не високосный год»

#Високосные года – года которые одновременно кратны 4 и не кратны 100, 
#или кратны 400.

#Входные данные:

#1996

#Выходные данные:

#Год високосный


#Входные данные:

#1998

#Выходные данные:

#Не високосный год

#Задача 4
#Программе дается с клавиатуры число – возраст человека. 
# Необходимо вывести к какой категории граждан он относится:

#"Младенец", если возраст меньше 2х лет;

#"Ребенок", если возраст от 2 лет, но меньше 12;

#"Подросток", когда возраст от 12 лет, но меньше 18;

#"Молодёжь", когда возраст от 18 лет, но меньше 35;

#"Взрослый человек", когда возраст от 35 лет, но меньше 60;

#"Пожилой человек", если возраст 60 лет и более.

#Входные данные:

#35

#Выходные данные:

#Взрослый человек